Обработки/Reports/_ОкончаниеСрокаДействияОценочныхЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОкончаниеСрокаДействияОценочныхЦен</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочихДнейДоОкончания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОкончаниеСрокаДействияОценочныхЦен/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет, 
		"Окончание срока действия оценочных цен", 
		"0.18", 
		"", 
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(
		Команды, 
		"ОкончаниеСрокаДействияОценочныхЦен_УКПИ",
		"Окончание срока действия оценочных цен УКПИ",,  
		Ложь, 
		"ВызовСерверногоМетода");
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(
		Команды, 
		"ОкончаниеСрокаДействияОценочныхЦен_УКПИ_ПИФ",
		"Окончание срока действия оценочных цен УКПИ (ПИФ)",,  
		Ложь, 
		"ВызовСерверногоМетода");
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(
		Команды, 
		"ОкончаниеСрокаДействияОценочныхЦен_РЭМ",
		"Окончание срока действия оценочных цен РЭМ",,  
		Ложь, 
		"ВызовСерверногоМетода");
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(
		Команды, 
		"ОкончаниеСрокаДействияОценочныхЦен_Траст",
		"Окончание срока действия оценочных цен Траст",,  
		Ложь, 
		"ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска обработки
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//     элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт

	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);

	Если СтрНачинаетсяС(ИдентификаторКоманды, "ОкончаниеСрокаДействияОценочныхЦен") Тогда
		Если Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата())) Тогда
			ЭтотОбъект.Период = ТекущаяДата();
			ЭтотОбъект.Организация  = ПараметрыКоманды.Организация;
			ЭтотОбъект.ВидДоговораДоверительногоУправления = ПараметрыКоманды.ВидДоговораДоверительногоУправления;
			ЭтотОбъект.РабочихДнейДоОкончания  = ПараметрыКоманды.ЗаСколькоРабочихДнейДоОкончания;
			
			ПолучателиОповещения	= ПараметрыКоманды.ПолучателиОповещения;
			
#Область СборСтатистики_Начало

			Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ВыполнитьКоманду()";
			
			ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(
				ЭтотОбъект, 
				"Период,Организация", 
				Новый Структура("ИдентификаторКоманды", ИдентификаторКоманды));
			
			Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
				Механизм,
				ПараметрыВыполненияДляСбораСтатистики.Хранилище,
				ПараметрыВыполненияДляСбораСтатистики.Описание);

#КонецОбласти
			
			ОтправитьОтчет(ПолучателиОповещения);
			
#Область СборСтатистики_Конец

			РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	

#КонецОбласти
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьОтчет(ПолучателиОповещения) Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ЭтотОбъект.СкомпоноватьРезультат(ДокументРезультат); 
	
	Если ДокументРезультат.ВысотаТаблицы > 2 Тогда
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("htm");
		ДокументРезультат.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML);
		
		ТемаПисьма = "Уведомление об окончании срока действия оценочных цен в течение " + ЭтотОбъект.РабочихДнейДоОкончания + " рабочих дней от "+ Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yy");
		
		ТелоПисьма = Новый ТекстовыйДокумент;
		ТелоПисьма.Прочитать(ИмяВременногоФайла);
		
		ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста", ПолучателиОповещения, ТемаПисьма, ТелоПисьма.ПолучитьТекст(), ТипТекстаПочтовогоСообщения.HTML);
		
		РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);
		
	КонецЕсли;
	
КонецПроцедуры	

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	Параметры.УстановитьЗначениеПараметра("Организация", ЭтотОбъект.Организация);
	Параметры.УстановитьЗначениеПараметра("Период", КонецДня(ЭтотОбъект.Период));
	Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(
		Справочники.Календари.ДобавитьКДатеРабочиеДни(
			Справочники.Календари.Общероссийский,
			НачалоДня(ЭтотОбъект.Период), 
			?(ЭтотОбъект.РабочихДнейДоОкончания = 0, 999, ЭтотОбъект.РабочихДнейДоОкончания))));
	Параметры.УстановитьЗначениеПараметра("ВидДоговораДоверительногоУправления", ЭтотОбъект.ВидДоговораДоверительногоУправления);
	
	// Выполняем программную компоновку
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);	
	
КонецПроцедуры
